app/controllers/book_comments_controller.rb

	def create
		@book = Book.find(params[:book_id])
		@book_comment = BookComment.new(book_comment_params)
		@book_comment = @book.book_comments.build(book_comment_params)
		@book_comment.book_id = @book.id
		@book_comment.user_id = current_user.id
		@book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["comment", "テスト１"], ["created_at", "2021-03-30 09:48:02.539431"], ["updated_at", "2021-03-30 09:48:02.539431"]]

	def destroy
		@book = Book.find(params[:book_id])
  	    book_comment = @book.book_comments.find(params[:id])
		book_comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? AND "book_comments"."id" = ? LIMIT ?  [["book_id", 8], ["id", 14], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 14]]