app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "rrrrrr"], ["profile_image_id", "7f2c52e52eaec1b86b650fd22fcd5e4ef34c11e9f7a7b47a45cfb4167f18"], ["updated_at", "2021-03-10 02:30:13.022429"], ["id", 1]]